# Optional taps if needed (e.g., for fonts)
tap "homebrew/cask-fonts"

# Formulae (CLI tools)
brew "ca-certificates"
brew "coreutils"
brew "gettext"
brew "git"
brew "gmp"
brew "libassuan"
brew "libgpg-error"
brew "libpng"
brew "libunistring"
brew "mpdecimal"
brew "ncurses"
brew "openssl"
brew "pcre"
brew "pinentry-mac"
brew "python"
brew "qrencode"
brew "readline"
brew "sqlite"
brew "trash"
brew "unar"
brew "xz"
brew "zsh"
brew "zsh-git-prompt"

# Casks (GUI apps)
cask "1password"
cask "alfred"
cask "bambu-studio"
cask "brave-browser"
cask "discord"
cask "firefox"
cask "folding-at-home"
cask "folx"
cask "font-jetbrains-mono-nerd-font"
cask "gitkraken"
cask "gpg-suite"
cask "iina"
cask "iterm2"
cask "logitech-g-hub"
cask "prefs-editor"
cask "raspberry-pi-imager"
cask "steam"
cask "visual-studio-code"
cask "vlc"