# ──────────────────────────────────────────────────────────────────────────────
# Brewfile — Managed by chezmoi
# Grouped by use case, items sorted alphabetically within each group
# ──────────────────────────────────────────────────────────────────────────────

# ─── Core CLI tools & essentials ─────────────────────────────────────────────
brew "ca-certificates"
brew "coreutils"               # gls on macOS
brew "gettext"
brew "git"
brew "gmp"
brew "jq"                      # JSON processor
brew "libassuan"
brew "libgpg-error"
brew "libpng"
brew "libunistring"
brew "mise"                    # version manager (node, python, etc.)
brew "mpdecimal"
brew "ncurses"
brew "openssl"
brew "pcre"
brew "pinentry-mac"
brew "python"
brew "readline"
brew "sqlite"
brew "starship"                # prompt
brew "trash"                   # safer rm
brew "unar"
brew "xz"
brew "yq"                      # YAML processor
brew "zsh"

# ─── Search, navigation & productivity ───────────────────────────────────────
brew "bat"                     # cat with syntax highlighting
brew "eza"                     # modern ls replacement with icons/git
brew "fd"                      # fast find alternative
brew "fzf"                     # fuzzy finder
brew "gh"                      # GitHub CLI
brew "ripgrep"                 # fast grep (rg)
brew "zoxide"                  # smarter cd (frecency-based)

# ─── Zsh enhancements (kept intentionally) ───────────────────────────────────
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ─── Other Miscellaneous Formulae ──────────────────────────────────────────────────────────
brew "bitcoin"                 # Bitcoin Core
brew "handbrake"               # video transcoding software
brew "monero"                  # Monero Wallet & Miner

# ─── Fonts (Nerd Fonts for Starship, Ghostty, editors, etc.) ─────────────────
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

# ─── Terminal & editors ──────────────────────────────────────────────────────
cask "ghostty"                 # terminal emulator
cask "visual-studio-code"      # primary editor

# ─── Security & password management ──────────────────────────────────────────
cask "1password"
cask "gpg-suite"

# ─── Browsers ────────────────────────────────────────────────────────────────
cask "brave-browser"
cask "firefox"

# ─── Communication & media ───────────────────────────────────────────────────
# cask "chirp"                   # ham radio programming software -- disabled due to Cloudflare isses on 2025-08-05
cask "discord"                 # chat and social
cask "iina"                    # video player
# cask "makemkv"                 # Digital Media Ripping Tool -- Deprecated because it does not pass the macOS Gatekeeper check! It will be disabled on 2026-09-01
cask "telegram-desktop".       # Desktop client for Telegram Messenger
cask "thunderbird"             # email and calendar client
cask "vlc"                     # video player

# ─── Utilities & productivity ────────────────────────────────────────────────
cask "alfred"                  # launcher
cask "folx"                    # download manager
cask "prefs-editor"            # preference plist editor

# ─── Development & hardware specific ─────────────────────────────────────────
cask "autodesk-fusion"         # CAD software for 3D design & printing
cask "bambu-studio"            # 3D printing (Bambu Lab)
cask "gitkraken"               # Git GUI
cask "raspberry-pi-imager"     # Pi OS flashing

# ─── Entertainment & misc ────────────────────────────────────────────────────
cask "folding-at-home"         # distributed computing
cask "steam"                   # gaming
cask "wondershare-uniconverter"

# ─── Crypto Related ──────────────────────────────────────────────────────────
cask "bluewallet".             # Bitcoin Wallet

# ─── Development & hardware specific (Run Last for Compatibility) ────────────
cask "logitech-g-hub"          # Logitech peripherals